/*let x = 10;
let y = 7;
let t = x > y ? "x больше, чем y" : "x не больше, чем y";
alert (t);*/


/*let num = +prompt("Введите число");
if (num % 2 === 0) {
    alert("Число » + num + » четное");
} else {
    alert("Число » + num + » нечетное");
}*/


/*let num = +prompt("Введите целое число");
if (num > 0) {
    alert("Число однозначно положительное, ")
    alert("num".length - 1);
} else {
    alert("Число однозначно отрицательное, ")
    alert("num".length - 1);
}*/


/*let a = +prompt("Введите первое число");
let b = +prompt("Введите второе число");
let c = +prompt("Введите третье число");
if (a > b && a > c) {
    alert("a - максимальное число");
} else if (b > a && b > c) {
    alert("b - максимальное число");
} else {
    alert("c - максимальное число");
}*/


/*let a = +prompt("Введите длину первой стороны треугольника");
let b = +prompt("Введите длину второй стороны треугольника");
let c = +prompt("Введите длину третьей стороны треугольника");
let d = a + b;
let e = a + c;
let f = b + c;
if (c < d && b < e && a < f) {
    alert("треугольник имеет право на жизнь!");
} else {
    alert("такой реугольник обречен! Увы...");
}*/
